#pragma once

// The Cycle Frontier (1.X) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "Prospect_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Prospect.YCharacterCustomizationActor
// 0x00F0 (0x05E0 - 0x04F0)
class AYCharacterCustomizationActor : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x04F0(0x0010) MISSED OFFSET
	class UYCameraInteractionComponent*                m_interactionComponent;                                   // 0x0500(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UYCustomizationCameraComponent*              m_customizationCameraComponent;                           // 0x0508(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0510(0x0010) MISSED OFFSET
	TArray<struct FYCharacterCustomizationActorActiveVisualizationEntry> m_activeVisualizedCustomizationEntries;                   // 0x0520(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_ContainsInstancedReference, CPF_NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                         m_equippedWeaponHandle;                                   // 0x0530(0x0010) (CPF_Transient, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>                 m_equippedVanityHandles;                                  // 0x0540(0x0010) (CPF_ZeroConstructor, CPF_Transient, CPF_NativeAccessSpecifierPublic)
	TArray<class AYCharacterCustomizationActor*>       m_childCustomizationActors;                               // 0x0550(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_NativeAccessSpecifierPublic)
	bool                                               m_clearMaterial;                                          // 0x0560(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               m_reactToGLobalVanityUpdates;                             // 0x0561(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               m_attachToLocalPlayerAtStart;                             // 0x0562(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               m_useMeshMerging;                                         // 0x0563(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               m_shouldSkelMeshComponentsSyncAttachParrentLOD;           // 0x0564(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0565(0x0003) MISSED OFFSET
	TArray<class USkeletalMesh*>                       m_meshToUseForMeshMerging;                                // 0x0568(0x0010) (CPF_ZeroConstructor, CPF_NativeAccessSpecifierPublic)
	TArray<EYCustomizationCategory>                    m_visualizationCategoriesToDisable;                       // 0x0578(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData03[0x1];                                       // 0x0588(0x0001) MISSED OFFSET
	bool                                               m_usingParentMeshForAttachments;                          // 0x0589(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData04[0x6];                                       // 0x058A(0x0006) MISSED OFFSET
	class AActor*                                      m_explicitCustomizationActor;                             // 0x0590(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class AActor*                                      m_playerCharacterCustomizationActor;                      // 0x0598(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               m_bindToPlayerStateData;                                  // 0x05A0(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData05[0x3F];                                      // 0x05A1(0x003F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YCharacterCustomizationActor"));
		return ptr;
	}


	void SetPlayerStateData(class APlayerState* playerStateData);
	void SetCategoryVisualized(EYCustomizationCategory Category);
	void RefreshActiveCustomizationData(const struct FYActiveCustomizationData& oldData, const struct FYActiveCustomizationData& customizationData, bool ForceRefresh);
	void OnWorldLocationChanged(const struct FTransform& worldOffsetLocation);
	void OnOnCustomizationCategoryChanged(EYCustomizationCategory newCategory);
	void OnInitializeEquippedWeapon(const struct FDataTableRowHandle& desiredRowHandle, TArray<struct FDataTableRowHandle> vanityEntries);
	void OnGlobalVanityUpdated();
	void OnFinishedAsyncLoading(const struct FYCharacterCustomizationBodyPart& bodyPart);
	void OnCharacterCustomizationLoadedSignature__DelegateSignature();
	void OnCategoryClickedCallback(EYCustomizationCategory Category);
	void LogDebugSelfInfo(const struct FString& Context);
	void HandlePlayerStateSet();
	void BP_SetWeaponAnimationPose(EYEquipedWeaponPoseType pose);
	void BP_SetPlayerState(class APlayerState* playerStateData);
	void BP_SetEmote(const struct FYCharacterCustomizationRowBase& deathEmoteRowBase);
	void BP_SetDeathEmote(const struct FYCharacterCustomizationRowBase& deathEmoteRowBase);
	void BP_PlayCustomizationMontage(class UAnimMontage* Montage, EYCustomizationCategory Category);
	void BP_OnShowCustomizationCategory(const struct FYShowBodyTypeCategoryUpdateData& customizationCategory);
	void BP_OnResetRequest(EYCharacterVanityResetRequest resetRequest);
	void BP_OnEOMMapLoaded();
	void BP_OnActiveCustomizationDataChanged(const struct FYActiveCustomizationData& newCustomizationData);
};


// Class Prospect.YCharacterCustomizationExplicitCustomizationActor
// 0x0150 (0x0730 - 0x05E0)
class AYCharacterCustomizationExplicitCustomizationActor : public AYCharacterCustomizationActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x05E0(0x0008) MISSED OFFSET
	struct FString                                     m_previewCameraSuffix;                                    // 0x05E8(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FYCustomizationExplicitActorInitializationData m_initializationData;                                     // 0x05F8(0x0130) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Protected, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0728(0x0001) MISSED OFFSET
	bool                                               m_registerCustomizationModeAssociation;                   // 0x0729(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData02[0x6];                                       // 0x072A(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YCharacterCustomizationExplicitCustomizationActor"));
		return ptr;
	}


	void OnCharacterCustomizationLoadedCallback();
	void BP_OnVisualziationState(const struct FYCharacterVisualizationRuntimeData& Data);
};


// Class Prospect.AYNPCCharacter
// 0x0000 (0x0730 - 0x0730)
class AAYNPCCharacter : public AYCharacterCustomizationExplicitCustomizationActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.AYNPCCharacter"));
		return ptr;
	}

};


// Class Prospect.DA_Escape
// 0x0050 (0x0088 - 0x0038)
class UDA_Escape : public UDataAsset
{
public:
	float                                              m_escapeTime;                                             // 0x0038(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	int                                                m_escapeLocations;                                        // 0x003C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USkeletalMesh*                               m_escapeShipSK;                                           // 0x0040(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UAnimationAsset*                             m_flyingAnim;                                             // 0x0048(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UAnimationAsset*                             m_hoverAnim;                                              // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UAnimationAsset*                             m_landedAnim;                                             // 0x0058(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UAnimationAsset*                             m_takingOffAnim;                                          // 0x0060(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_landingPauzeTime;                                       // 0x0068(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_landingTime;                                            // 0x006C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_landedTime;                                             // 0x0070(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_departureAlarmTime;                                     // 0x0074(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UStaticMesh*                                 m_escapeConsoleSM;                                        // 0x0078(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_consoleCooldownTime;                                    // 0x0080(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.DA_Escape"));
		return ptr;
	}

};


// Class Prospect.DA_Uplink
// 0x00A0 (0x00D8 - 0x0038)
class UDA_Uplink : public UDataAsset
{
public:
	float                                              m_durationUpdateCommon;                                   // 0x0038(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_durationUpdateUnCommon;                                 // 0x003C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_durationUpdateRare;                                     // 0x0040(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_durationUpdateEpic;                                     // 0x0044(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USkeletalMesh*                               m_uplinkSkeletalMesh;                                     // 0x0048(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundUpdateStart;                                       // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundUpdateInterupt;                                    // 0x0058(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundUpdateCompleted;                                   // 0x0060(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundUpdateWhile;                                       // 0x0068(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundPowerGain;                                         // 0x0070(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundPowerLoss;                                         // 0x0078(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_durationInteractConsole;                                // 0x0080(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	class UStaticMesh*                                 m_consoleMesh;                                            // 0x0088(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundConsoleStartUpdate;                                // 0x0090(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundConsoleInteruptUpdate;                             // 0x0098(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundConsoleCompleteUpdate;                             // 0x00A0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundConsolePowerGain;                                  // 0x00A8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_soundConsolePowerLoss;                                  // 0x00B0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_durationFuseBoxInteract;                                // 0x00B8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET
	class UStaticMesh*                                 m_FuseBoxMesh;                                            // 0x00C0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_SoundEnable;                                            // 0x00C8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class USoundBase*                                  m_SoundDisable;                                           // 0x00D0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.DA_Uplink"));
		return ptr;
	}

};


// Class Prospect.TestRootScreenController
// 0x0000 (0x00B8 - 0x00B8)
class UTestRootScreenController : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestRootScreenController"));
		return ptr;
	}


	void OnOpenScreenButton();
	void OnLeftState();
	void OnEnteredState();
	void OnCloseScreenButton();
};


// Class Prospect.TestScreen1Controller
// 0x0000 (0x00B8 - 0x00B8)
class UTestScreen1Controller : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestScreen1Controller"));
		return ptr;
	}


	void OnOpenScreenButton();
	void OnLeftState();
	void OnEnteredState();
	void OnCloseScreenButton();
};


// Class Prospect.TestScreen2Controller
// 0x0000 (0x00B8 - 0x00B8)
class UTestScreen2Controller : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestScreen2Controller"));
		return ptr;
	}


	void OnOpenScreenButton();
	void OnLeftState();
	void OnEnteredState();
	void OnCloseScreenButton();
};


// Class Prospect.TestModel
// 0x0000 (0x00B8 - 0x00B8)
class UTestModel : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestModel"));
		return ptr;
	}


	struct FString GetSomeData();
};


// Class Prospect.State
// 0x0018 (0x0048 - 0x0030)
class UState : public UObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0030(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.State"));
		return ptr;
	}

};


// Class Prospect.RootState
// 0x0000 (0x0048 - 0x0048)
class URootState : public UState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.RootState"));
		return ptr;
	}

};


// Class Prospect.TestScreenRoot
// 0x0040 (0x0088 - 0x0048)
class UTestScreenRoot : public URootState
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0048(0x0018) MISSED OFFSET
	TSoftClassPtr<class UClass>                        m_widgetBp;                                               // 0x0060(0x0028) (CPF_Edit, CPF_DisableEditOnInstance, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestScreenRoot"));
		return ptr;
	}

};


// Class Prospect.TestState1
// 0x0000 (0x0048 - 0x0048)
class UTestState1 : public UState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestState1"));
		return ptr;
	}

};


// Class Prospect.TestScreen1
// 0x0040 (0x0088 - 0x0048)
class UTestScreen1 : public UTestState1
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0048(0x0018) MISSED OFFSET
	TSoftClassPtr<class UClass>                        m_widgetBp;                                               // 0x0060(0x0028) (CPF_Edit, CPF_DisableEditOnInstance, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestScreen1"));
		return ptr;
	}

};


// Class Prospect.TestState2
// 0x0000 (0x0048 - 0x0048)
class UTestState2 : public UState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestState2"));
		return ptr;
	}

};


// Class Prospect.TestScreen2
// 0x0040 (0x0088 - 0x0048)
class UTestScreen2 : public UTestState2
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0048(0x0018) MISSED OFFSET
	TSoftClassPtr<class UClass>                        m_widgetBp;                                               // 0x0060(0x0028) (CPF_Edit, CPF_DisableEditOnInstance, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPrivate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.TestScreen2"));
		return ptr;
	}

};


// Class Prospect.YChatExternalFunctions
// 0x0000 (0x0030 - 0x0030)
class UYChatExternalFunctions : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YChatExternalFunctions"));
		return ptr;
	}


	static bool IsUserMuted(const struct FString& UserId, bool isVoice);
	static bool IsPlayerNameMuted(class AActor* actorContext, const struct FString& playerName, bool isVoice);
	static struct FText ChannelTypeToText(class UObject* objectContext, EYChannelType ChannelType);
};


// Class Prospect.YAbilityActor
// 0x0018 (0x0268 - 0x0250)
class AYAbilityActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0250(0x0008) MISSED OFFSET
	struct FDataTableRowHandle                         m_spawnedRowHandle;                                       // 0x0258(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_NoDestructor, CPF_ExposeOnSpawn, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YAbilityActor"));
		return ptr;
	}

};


// Class Prospect.YAbilityAnalyticsComponent
// 0x0010 (0x00C8 - 0x00B8)
class UYAbilityAnalyticsComponent : public UActorComponent
{
public:
	TArray<struct FYAbilityAnalyticsPerPlayer>         m_abilityPerPlayerAnalytics;                              // 0x00B8(0x0010) (CPF_ZeroConstructor, CPF_NativeAccessSpecifierPrivate)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YAbilityAnalyticsComponent"));
		return ptr;
	}


	void SendDropAbilityData(class AActor* playerControllerActor, const struct FDataTableRowHandle& abilityRowHandle);
	void OnAbilityUsed(class AActor* PlayerController, const struct FYInventoryItem& inventoryItem);
	void OnAbilityEquipped(class AActor* PlayerController, const struct FYInventoryItem& inventoryItem);
};


// Class Prospect.YAbilityContextUtils
// 0x0000 (0x0030 - 0x0030)
class UYAbilityContextUtils : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YAbilityContextUtils"));
		return ptr;
	}

};


// Class Prospect.YAbilityExternalFunctions
// 0x0000 (0x0030 - 0x0030)
class UYAbilityExternalFunctions : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YAbilityExternalFunctions"));
		return ptr;
	}


	static bool FindWeaponTuningData(const struct FDataTableRowHandle& weaponTransportRow, struct FYWeaponTuningDataTableRow* outData);
	static bool FindSpawnedDatatableRowHandleFromObject(class UObject* relevantObject, struct FDataTableRowHandle* outRowHandle);
	static bool FindKineticShieldAbilityDataFromObject(class UObject* relevantObject, struct FYAbilityActionKineticShieldData* outData);
	static bool FindHealWardAbilityDataFromObject(class UObject* relevantObject, struct FYAbilityActionHealWardData* outData);
	static bool FindCloakAbilityDataFromObject(class UObject* relevantObject, struct FYAbilityActionCloakData* outData);
	static bool FindBombardmentAbilityDataFromObject(class UObject* relevantObject, struct FYAbilityActionBombardmentData* outData);
	static bool FindBlinkAbilityDataFromObject(class UObject* relevantObject, struct FYAbilityActionBlinkData* outData);
	static bool FindAbilityActionDataFromObject(class UObject* relevantObject, struct FYAbilityActionDataTableRow* outData);
	static int ExecuteAbilityTransport(const struct FYAbilityTransportInitializationData& executionInitData);
	static float DetermineActiveTimeTotal(const struct FDataTableRowHandle& abilityRow, class UObject* contextPlayerObject);
};


// Class Prospect.YAbilityPossessionActor
// 0x0000 (0x0250 - 0x0250)
class AYAbilityPossessionActor : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YAbilityPossessionActor"));
		return ptr;
	}


	void BP_OnPossesionStateChanged(bool newState);
};


// Class Prospect.YAbstractMissionActor
// 0x0000 (0x0250 - 0x0250)
class AYAbstractMissionActor : public AActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YAbstractMissionActor"));
		return ptr;
	}

};


// Class Prospect.YActivities_DeveloperSettings
// 0x0030 (0x0070 - 0x0040)
class UYActivities_DeveloperSettings : public UDeveloperSettings
{
public:
	EYDebugActivitySpawnMode                           m_debugSpawnActivityMode;                                 // 0x0040(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_Config, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
	struct FDataTableRowHandle                         m_debugSet;                                               // 0x0048(0x0010) (CPF_Edit, CPF_Config, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)
	TArray<EYActivityType>                             m_debugActivities;                                        // 0x0058(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_Config, CPF_NativeAccessSpecifierPublic)
	bool                                               m_bEnableRandomSeedOverride;                              // 0x0068(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_Config, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0069(0x0003) MISSED OFFSET
	int                                                m_randomizationSeed;                                      // 0x006C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_Config, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivities_DeveloperSettings"));
		return ptr;
	}

};


// Class Prospect.YActivitiesManager
// 0x0090 (0x0148 - 0x00B8)
class UYActivitiesManager : public UActorComponent
{
public:
	TArray<class UYActivityComponent*>                 m_activityComponents;                                     // 0x00B8(0x0010) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_ContainsInstancedReference, CPF_NativeAccessSpecifierPublic)
	int                                                m_spawnRequestsAllowedPerFrame;                           // 0x00C8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET
	TArray<struct FYSpawnActivityActorTokenData>       m_spawnTokens;                                            // 0x00D0(0x0010) (CPF_ZeroConstructor, CPF_Transient, CPF_ContainsInstancedReference, CPF_NativeAccessSpecifierPublic)
	TArray<EYActivityType>                             m_activeActivityTypes;                                    // 0x00E0(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                         m_activitySet;                                            // 0x00F0(0x0010) (CPF_Edit, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                         m_activitySetTutorial;                                    // 0x0100(0x0010) (CPF_Edit, CPF_NoDestructor, CPF_NativeAccessSpecifierPublic)
	TArray<class AYActivityActorManager*>              m_activities;                                             // 0x0110(0x0010) (CPF_ZeroConstructor, CPF_Transient, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0120(0x0008) MISSED OFFSET
	struct FMulticastScriptDelegate                    OnActivitiesSpawned;                                      // 0x0128(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FMulticastScriptDelegate                    OnSpawnTokensEmpty;                                       // 0x0138(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivitiesManager"));
		return ptr;
	}


	void OnActivitiesLoaded();
	bool IsActivityActive(EYActivityType Type);
	class AYActivityActorManager* GetActivityByType(EYActivityType activityType);
	TArray<class AYActivityActorManager*> GetActivities();
	static class UYActivitiesManager* FindActivitiesManager(class UObject* WorldContextObject);
	bool AddSpawnActivityActorToken(const struct FYSpawnActivityActorTokenData& requestData);
};


// Class Prospect.YActivityActorInterface
// 0x0000 (0x0030 - 0x0030)
class UYActivityActorInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityActorInterface"));
		return ptr;
	}


	struct FVector GetDrawDebugLineTo();
	struct FCoreUObject_FColor GetDrawDebugLineColor();
	struct FString GetDebugDescription();
};


// Class Prospect.YActivityActorManager
// 0x0080 (0x02D0 - 0x0250)
class AYActivityActorManager : public AActor
{
public:
	class UYActivityRegisterComponent*                 m_registerComponent;                                      // 0x0250(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	EYActivityType                                     m_activityType;                                           // 0x0258(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0259(0x0007) MISSED OFFSET
	class UClass* /*UObject*/                          m_defaultActivityActorClass;                              // 0x0260(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x58];                                      // 0x0268(0x0058) MISSED OFFSET
	struct FMulticastScriptDelegate                    BP_OnInitialActorSpawningFinished;                        // 0x02C0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_BlueprintCallable, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityActorManager"));
		return ptr;
	}


	TArray<class AActor*> GetSpecialDebugActors();
	int GetNumSpawnedActors();
	int GetDesiredActorCount();
	struct FYActivityDataTableRow GetActivityTuning();
	void DebugRequestTriggerActivity(class APlayerController* requestingPlayer);
	class AActor* BP_SpawnActivityActorFromToken(const struct FYSpawnActivityActorTokenData& requestData);
	void BP_OnStartActorSpawning();
	struct FString BP_GetDebugDescription();
};


// Class Prospect.YActivityComponent
// 0x0078 (0x0130 - 0x00B8)
class UYActivityComponent : public UActorComponent
{
public:
	bool                                               m_destroySkeletalMeshesOnDedicatedServer;                 // 0x00B8(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               m_isPlacedInWorld;                                        // 0x00B9(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData00[0x6];                                       // 0x00BA(0x0006) MISSED OFFSET
	class AYActivityActorManager*                      m_activityActorManager;                                   // 0x00C0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UYActivityRegisterComponent*                 m_registerComponent;                                      // 0x00C8(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class AYActivityLocation*                          m_activityLocation;                                       // 0x00D0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	bool                                               m_isMarkedAsDepleted;                                     // 0x00D8(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00D9(0x0007) MISSED OFFSET
	struct FString                                     m_activitySubType;                                        // 0x00E0(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FString                                     m_actorBIName;                                            // 0x00F0(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FMulticastScriptDelegate                    OnActivityActorDepleted;                                  // 0x0100(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FMulticastScriptDelegate                    OnActivitySetupComplete;                                  // 0x0110(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	struct FMulticastScriptDelegate                    OnActivitySetupCompletePlacedInWorld;                     // 0x0120(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityComponent"));
		return ptr;
	}


	void SetupActivityComponent(class AYActivityActorManager* Activity, class AYActivityLocation* activityLocation, class UYActivityRegisterComponent* registerOverride);
	void MarkActivityActorAsDepleted();
	EYActivityType GetActivityType();
	class AYActivityLocation* GetActivityLocation();
	class AYActivityActorManager* GetActivity();
};


// Class Prospect.YActivityDebugMapMarkerManager
// 0x0018 (0x00D0 - 0x00B8)
class UYActivityDebugMapMarkerManager : public UActorComponent
{
public:
	class UClass* /*UYDebugActivityLocationMapMarkerData*/ m_mapMarkerClass;                                         // 0x00B8(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_UObjectWrapper, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	TArray<class UYMapMarkerData*>                     m_data;                                                   // 0x00C0(0x0010) (CPF_ZeroConstructor, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityDebugMapMarkerManager"));
		return ptr;
	}

};


// Class Prospect.YActivityFunctions
// 0x0000 (0x0030 - 0x0030)
class UYActivityFunctions : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityFunctions"));
		return ptr;
	}


	static void Sort(TArray<struct FYActivityCountEntry>* arrayToSort);
	static void SendActivityAnalyticsEvent(class AActor* Actor, EYActivityType Type, bool isSpawning, const struct FString& activitySubType);
	static void RenameActor(class AActor* Actor, const struct FString& Name);
	static bool IsInsideActivityArea(class AActor* actorContext, struct FString* outAreaName);
	static bool IsActorSpawnedByArea(class AActor* Actor);
	static bool IsActorReplicatingMovement(class AActor* Actor);
	static struct FString GetStringFromActivityType(EYActivityType activityType);
	static struct FString GetLevelName(class AActor* Actor);
	static class ULevel* GetLevel(class AActor* Actor);
	static float GetDebugActivitySpawnDistanceMultiplier();
	static float GetClosestPlayerDistanceToActor(class AActor* Actor);
	static TArray<EYActivityType> GetAllMineralActivities();
	static EYActivityType GetActivityTypeFromString(const struct FString& inString);
	static struct FYActivityDataTableRow GetActivityTuning(class UObject* WorldContextObject, EYActivityType activityType);
};


// Class Prospect.YActivityLocation
// 0x0048 (0x0298 - 0x0250)
class AYActivityLocation : public AActor
{
public:
	EYActivityLocationStatus                           m_status;                                                 // 0x0250(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0251(0x0003) MISSED OFFSET
	float                                              m_respawnBlockTime;                                       // 0x0254(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	TArray<EYActivityType>                             m_compatibleActivities;                                   // 0x0258(0x0010) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_NativeAccessSpecifierPublic)
	EYActivityType                                     m_activityType;                                           // 0x0268(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0269(0x0003) MISSED OFFSET
	float                                              m_spawnWeight;                                            // 0x026C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FTimerHandle                                m_timerHandleFreeLocation;                                // 0x0270(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	struct FMulticastScriptDelegate                    BP_OnStatusChanged;                                       // 0x0278(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)
	bool                                               m_isGenericActivityLocation;                              // 0x0288(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0289(0x0003) MISSED OFFSET
	float                                              m_spawnRadiusOverride;                                    // 0x028C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	float                                              m_despawnMinTimeNoPlayerClose;                            // 0x0290(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               m_hiddenInEditor;                                         // 0x0294(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0295(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityLocation"));
		return ptr;
	}


	void NotifyIsAvailable();
	void NotifyActorDestroyed();
	struct FString GetDebugDescription();
	int GetAdditionalDebugInfo();
	EYActivityType GetActivityType();
	float DetermineRespawnBlockTime();
};


// Class Prospect.YActivityLocationEQS
// 0x0068 (0x0300 - 0x0298)
class AYActivityLocationEQS : public AYActivityLocation
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0298(0x0008) MISSED OFFSET
	class UEnvQuery*                                   QueryTemplate;                                            // 0x02A0(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	TArray<struct FEnvNamedValue>                      QueryParams;                                              // 0x02A8(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_NativeAccessSpecifierPublic)
	TArray<struct FAIDynamicParam>                     QueryConfig;                                              // 0x02B8(0x0010) (CPF_Edit, CPF_ZeroConstructor, CPF_NativeAccessSpecifierPublic)
	float                                              TimeLimitPerStep;                                         // 0x02C8(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	int                                                StepToDebugDraw;                                          // 0x02CC(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	EYEnvQueryHightlightMode                           HighlightMode;                                            // 0x02D0(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData01[0x3];                                       // 0x02D1(0x0003) MISSED OFFSET
	unsigned char                                      bDrawLabels : 1;                                          // 0x02D4(0x0001) (CPF_Edit, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      bDrawFailedItems : 1;                                     // 0x02D4(0x0001) (CPF_Edit, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      bReRunQueryOnlyOnFinishedMove : 1;                        // 0x02D4(0x0001) (CPF_Edit, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      bShouldBeVisibleInGame : 1;                               // 0x02D4(0x0001) (CPF_Edit, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      bTickDuringGame : 1;                                      // 0x02D4(0x0001) (CPF_Edit, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData02[0x3];                                       // 0x02D5(0x0003) MISSED OFFSET
	TEnumAsByte<EEnvQueryRunMode>                      QueryingMode;                                             // 0x02D8(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData03[0x27];                                      // 0x02D9(0x0027) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityLocationEQS"));
		return ptr;
	}


	void RunEQSQuery();
};


// Class Prospect.YActivityLocationLinked
// 0x0168 (0x0468 - 0x0300)
class AYActivityLocationLinked : public AYActivityLocationEQS
{
public:
	float                                              m_linkRadius;                                             // 0x0300(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	int                                                m_scoreSpawnThreshold;                                    // 0x0304(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	TMap<EYActivityType, int>                          m_scorePerType;                                           // 0x0308(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_NativeAccessSpecifierPublic)
	TMap<EYActivityType, int>                          m_debugInfoActorsInRadius;                                // 0x0358(0x0050) (CPF_Edit, CPF_BlueprintVisible, CPF_EditConst, CPF_NativeAccessSpecifierPublic)
	EYLinkType                                         m_linkType;                                               // 0x03A8(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x7];                                       // 0x03A9(0x0007) MISSED OFFSET
	struct FYEvaluationResult                          m_lastEvaluationResult;                                   // 0x03B0(0x00A8) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_NativeAccessSpecifierPublic)
	struct FMulticastScriptDelegate                    BP_OnEvaluated;                                           // 0x0458(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityLocationLinked"));
		return ptr;
	}


	static TArray<class AYActivityLocation*> RunEvaluationCheckForLocations(class UObject* contextObject, EYActivityType Type);
	struct FString GetLinkDebugDescription();
	bool EvaluateLocation();
	void DebugUpdateRunLinkActorCheck(TArray<class AYActivityLocation*>* outLinkedLocations);
	bool DebugIsEncapsulatedByArea();
};


// Class Prospect.YActivityLocationsManager
// 0x00F8 (0x01B0 - 0x00B8)
class UYActivityLocationsManager : public UActorComponent
{
public:
	TMap<EYActivityType, struct FYActivityLocationArray> m_locations;                                              // 0x00B8(0x0050) (CPF_Transient, CPF_NativeAccessSpecifierPublic)
	TMap<class AYActivityLocationLinked*, struct FYActivityLinkedLocations> m_linkedLocationInfo;                                     // 0x0108(0x0050) (CPF_Transient, CPF_NativeAccessSpecifierPublic)
	TMap<class AYActivityLocation*, class AYActivityLocationLinked*> m_locationToArea;                                         // 0x0158(0x0050) (CPF_Transient, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x8];                                       // 0x01A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityLocationsManager"));
		return ptr;
	}


	void OnActivitiesLoaded();
	TArray<class AYActivityLocation*> FindSpawnLocations(const struct FYFindActivityLocationsRequestData& Request);
	static class UYActivityLocationsManager* FindActivityLocationsManager(class UObject* WorldContextObject);
};


// Class Prospect.YActorWidget
// 0x00D8 (0x03A8 - 0x02D0)
class UYActorWidget : public UYWidget
{
public:
	class UCanvasPanel*                                m_offscreenCanvasPanel;                                   // 0x02D0(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	class UCanvasPanel*                                m_offscreenRotationContainer;                             // 0x02D8(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	bool                                               m_offScreenArrowEnabled;                                  // 0x02E0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData00[0x7];                                       // 0x02E1(0x0007) MISSED OFFSET
	class UYActorWidgetController*                     m_actorWidgetController;                                  // 0x02E8(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class AActor*                                      m_actor;                                                  // 0x02F0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	struct FYActorUIWidgetData                         m_widgetData;                                             // 0x02F8(0x00B0) (CPF_Edit, CPF_BlueprintVisible, CPF_Protected, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActorWidget"));
		return ptr;
	}


	void BP_SetWidgetData(const struct FYActorUIWidgetData& widgetData);
	void BP_OnActorSet();
	void BP_OffScreenUpdate(bool OffScreen);
};


// Class Prospect.YActivityProgressActorWidget
// 0x0010 (0x03B8 - 0x03A8)
class UYActivityProgressActorWidget : public UYActorWidget
{
public:
	class UEditableText*                               m_statusText;                                             // 0x03A8(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)
	class UProgressBar*                                m_progressBar;                                            // 0x03B0(0x0008) (CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData, CPF_NoDestructor, CPF_Protected, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierProtected)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActivityProgressActorWidget"));
		return ptr;
	}


	void ShowProgress(float progress);
	void ShowMessage(const struct FText& Text);
	void OnStateUpdated(int newState);
};


// Class Prospect.YActorWidgetController
// 0x0010 (0x0048 - 0x0038)
class UYActorWidgetController : public UYWidgetController
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	class AActor*                                      m_actor;                                                  // 0x0040(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData, CPF_NoDestructor, CPF_HasGetValueTypeHash, CPF_NativeAccessSpecifierPublic)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Prospect.YActorWidgetController"));
		return ptr;
	}

};


// Class Prospect.YActivityProgressActorWidgetController
// 0x0008 (0x0050 - 0x0048)
class UYActivityProgressActorWidgetController : public UYActorWidgetController
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0048(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
